Revit 2024 API
BuiltInFailures.GroupFailures.NoModelGroups Property
 There are no Model Groups in this Project or Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoModelGroups { get; }
Visual Basic
Public Shared ReadOnly Property NoModelGroups As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoModelGroups {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace